backend/README.md
```mermaid
flowchart TD
  subgraph Persons
    A["Participant
       planning poker player"]
    C["Spectator
       A planning poker player who is not
       actively participating"]
  end

  subgraph System
    B["Planning Poker System"]
  end

  A-->|Gives estimations|B
  C-->|Starts and ends estimation rounds|B
```
