backend/README.md
```mermaid
flowchart TD
  A["Persons
     A planning poker player who is either
     actively estimating or a spectator"]

  subgraph System
    B[("Database
        Stores rooms, their participants,
        the current task and its estimations")]
    C["KeepAlive Handler
       Regularly pings clients in order
       to prevent timeouts"]
    D["CDN
       Delivers the static content for the SPA"]
    E["SPA
       Provides planning poker functionality
       via web browser"]
    F["WebSocket Event Handler
       Handles incoming and outgoing planning
       poker events"]
  end

  A--->D
  A--->E
  C--->B
  C--->E
  D--->E
  E--->F
  F--->B
  F--->E
```
